{
  "latestVersion": "1.3.1",
  "changelogs": [
{
  "version": "1.3.1",
  "date": "2025-08-15",
  "changes": [
    "Data Migration - your data from v1.2.0 will convert to the new format.",
    "Sorry if you lost your data from v1.3.0",
    "Revamped Settings - Looks cleaner and neater!",
    "New changelogs/about design - Improved layout and readability.",
    "and fixed other bugs that are unnecessary to be noted"
  ]
},

{
  "version": "1.3.0",
  "date": "2025-08-14",
  "changes": [
    "You can now filter scripts by Free, Key System, Paid, or show all",
    "Connected Zexium API so you can run custom scripts and talk with the client",
    "New option to run a script right when you join and set script keys",
    "Connection status icons are now clickable and show more details",
    "Zexium status icons now show if you're connected or not",
    "Made the app’s transparency match better across all parts",
    "Connection status section now uses proper icons and smooth hover effects",
    "Status popups now show live connection updates"
  ]
},
{
  "version": "1.2.0",
  "date": "2025-08-03",
  "changes": [
    "Added update popup - you now choose whether to install updates instead of forced updates",
        "Redesigned navigation with icons and text labels for better user experience",
        "Added new Scripts tab with script hub featuring browseable script cards",
        "Reordered navigation to Editor, Scripts, Settings, About for better workflow",
        "Added working search functionality to filter script cards by title and description",
        "Decreased the app's background transparency for better visibility",
        "Added descriptions to all settings for better clarity",
        "Changed ACE editor theme to Twilight since the previous one was too vibrant"
      ]
    },
    {
      "version": "1.1.2",
      "date": "2025-08-01",
      "changes": [
        "Added auto-updater - app now updates itself automatically",
        "New one-line installer that actually works without needing developer tools",
        "Fixed icon not showing up properly",
        "Made releases way easier - just run one command",
        "App now checks for updates when you start it"
      ]
    },
    {
      "version": "1.1.1",
      "date": "2025-07-31",
      "changes": [
        "Fixed Discord status not showing the right script name",
        "Fixed rename button - it actually opens a popup now instead of being broken",
        "Removed that annoying opacity slider",
        "Discord now shows 'Script 1.lua' like it should",
        "Discord connection is more stable now"
      ]
    },
    {
      "version": "1.1.0",
      "date": "2025-07-31",
      "changes": [
        "Added About tab so you can see app info and updates",
        "Added settings for Discord, opacity, and notifications",
        "You can now clear all your app data if you want",
        "Raised tab limit to 30 (was way too low before)",
        "Fixed bug where you couldn't rename your user",
        "Made the settings look better"
      ]
    },
    {
      "version": "1.0.0",
      "date": "2025-07-30",
      "changes": [
        "First version of Zyron",
        "Basic script editing and running scripts",
        "Tab system for multiple scripts",
        "Cool glass-like UI with performance mode"
      ]
    }
  ]
}
